var store = [{
        "title": "첫 포스팅 하기!",
        "excerpt":"GitHub Blog를 활용한 첫 테스트 포스팅이다. 데이터 분석/개발/IT 쪽 관련 내용을 주로 포스팅할 예정이며, 가끔 일상 관련된 내용도 올리고자 한다.   내가 갖고 있는 지식과 스킬을 나누고 공유하여 모두 윈윈할 수 있는 그런 블로그가 되면 좋겠다. 소통의 장이랄까? 그런 블로그가 되길 원한다.  ","categories": ["Blog"],
        "tags": ["Blog"],
        "url": "/blog/first-post-test/",
        "teaser": null
      },{
        "title": "데이터 분석가란?",
        "excerpt":"안녕하세요. 블로그 첫 포스팅으로 무엇을 할까 많은 고민 끝에 데이터 분석가 직무에 대해서 제 개인적인 생각을 풀어보고자 합니다. 더 넓게는 데이터 전문가 영역에 대한 얘기를 하게 될 것 같네요. 2010년대 후반에 빅데이터 분야가 미디어를 통해 일반 대중들에게 소개되기 시작하면서 데이터 전문가에 대한 관심이 폭발하게 됩니다(물론, 그 전부터 관련 분야는 성장하고...","categories": ["Data"],
        "tags": ["Data"],
        "url": "/data/second-post/",
        "teaser": null
      }]
