var store = [{
        "title": "첫 포스팅 하기!",
        "excerpt":"GitHub Blog를 활용한 첫 테스트 포스팅이다. 데이터 분석/개발/IT 쪽 관련 내용을 주로 포스팅할 예정이며, 가끔 일상 관련된 내용도 올리고자 한다.   내가 갖고 있는 지식과 스킬을 나누고 공유하여 모두 윈윈할 수 있는 그런 블로그가 되면 좋겠다. 소통의 장이랄까? 그런 블로그가 되길 원한다.  ","categories": ["Blog"],
        "tags": ["Blog"],
        "url": "/blog/first-post-test/",
        "teaser": null
      },{
        "title": "[커리어] 데이터 분석가란?",
        "excerpt":"안녕하세요. 블로그 첫 포스팅으로 무엇을 할까 많은 고민 끝에 데이터 분석가 직무에 대해서 제 개인적인 생각을 풀어보고자 합니다. 더 넓게는 데이터 전문가 영역에 대한 얘기를 하게 될 것 같네요. 2010년대 후반에 빅데이터 분야가 미디어를 통해 일반 대중들에게 소개되기 시작하면서 데이터 전문가에 대한 관심이 폭발하게 됩니다(물론, 그 전부터 관련 분야는 성장하고...","categories": ["Data"],
        "tags": ["Data","커리어"],
        "url": "/data/second-post/",
        "teaser": null
      },{
        "title": "[DB] 데이터베이스(DB)란?!",
        "excerpt":"안녕하세요. 요즘 DB와 SQL 공부를 하고 있는데요. 데이터 분석가로 일하다보니 DB와 SQL에 대해서 제대로 알아야 겠다는 생각이 드는 요즘입니다. 왜냐하면 대부분의 데이터들은 보통 데이터베이스에 보관되어 있고 우리는 그 데이터베이스에 접근하여 데이터를 가져와야 하기 때문이죠. 따라서 최근 토이프로젝트로 가계부 프로그램을 만들어보면서 DB를 직접 설계해보고 공부한 것들 그리고 SQL에 대해서도 한 번...","categories": ["Data"],
        "tags": ["Data","DB"],
        "url": "/data/db_1/",
        "teaser": null
      },{
        "title": "[하루일기] '23/02/23 - 엑셀도 DB일 수 있을까?!(ft. 데이터 전처리)",
        "excerpt":"안녕하세요. 데이터 분석 실무를 하다보니 어느새부턴가 개인적으로 엑셀로 저장된 데이터를 기피하게 되더군요. 이번 분석 프로젝트에서 클라이언트사의 중요한 데이터가 엑셀로 보관되어 있었고, 최근 5년치의 데이터를 엑셀로부터 가져와야 했습니다. 데이터 수집 프로그램을 짜다가 발생하는 수많은 오류를 마주하면서 얼마 전 팀장님이 고객에게 지나가듯이 했던 말이 떠올랐습니다. “엑셀도 DB의 일종이죠. “ 정말로 엑셀도 DB일...","categories": ["Data"],
        "tags": ["Data","DB"],
        "url": "/data/daily-memo/",
        "teaser": null
      },{
        "title": "[프로젝트회고록] 01. 첫번째 분석 프로젝트: 올바른 문제정의와 가설 설정의 중요성",
        "excerpt":"  회고록 시리즈는 수행했던 프로젝트를 정리하고 기록하기 위한 시리즈입니다. 자세한 내용은 회사의 기밀 유지를 위하여 오픈하기 어렵지만, 문제에 어떻게 접근했고, 문제를 어떻게 해결했고, 어떤 인사이트를 도출했고, 아쉬운 점 등 쓸 수 있는 만큼 정리하겠습니다.   ‘20년 9월 입사한 후 짧은 적응기간을 걸치고 11월말 킥오프 미팅을 시작으로 바로 프로젝트에 투입됐다. 신입인데...","categories": ["Data"],
        "tags": ["Data","Projects","Memoir"],
        "url": "/data/projects_memoir1/",
        "teaser": null
      },{
        "title": "[회고록] 23년 3월 5주차 회고록",
        "excerpt":"  지난 1주는 이번 3월 한달 간 수행한 분석 내용에 대한 월간 보고자료를 작성하느라 정신없이 보냈다. 팀장님과 같이 보고서를 조금이라도 더 명료하고 쉽게 작성하기 위해 수없이 보고서를 뒤엎고, 수정했다. 고생끝에 월간 보고자료 작성을 잘 마쳤고 고객분들계 보내드렸다. 데이터 분석 컨설팅 업무 특성상 일하면서 많은 회의록과 분석 보고서 등 많은 문서를...","categories": ["Data"],
        "tags": ["Data","Memoir"],
        "url": "/data/weekly_memoir_3/",
        "teaser": null
      },{
        "title": "[프로젝트회고록] 02. 두번째 회고록: 유의차 분석",
        "excerpt":"  안녕하세요. 이번에는 Y인자가 이항 변수(Binary Variable)일 때, 어떻게 문제에 접근했고 풀었는지 초점을 맞춰서 프로젝트를 회고해보고자 합니다. 주 포인트는 아래와 같습니다. 유의차 분석 데이터 셋이 불균형일 때 해결방법 1. 프로젝트 개요   이번 프로젝트에서 클라이언트의 요청사항은 2가지 였다. 첫 번째는 특정 공정에서 발생하는 품질 이상 발생 방지를 위하여 핵심인자를 규명하는...","categories": ["Data"],
        "tags": ["Data","Projects","Memoir"],
        "url": "/data/projects_memoir2/",
        "teaser": null
      },{
        "title": "[회고록] 23년 3월 2주차 회고록",
        "excerpt":"  첫 주차별 회고록입니다. 현재 프로젝트 초반기라 정신없이 지내고 있는데, 기록하고 싶은 것들이 있어 이렇게 회고록을 작성합니다. 이번 회고록은 두 가지 키워드를 중심으로 적고자 하는데, 하나는 데이터의 품질과 다른 하나는 에너지 분석입니다.   본격적인 회고록을 작성하기 전에 현재 어떤 프로젝트를 진행중인지 간단하게 설명하겠습니다. 저는 현재 제조 공장에서 데이터 분석을 통해...","categories": ["Data"],
        "tags": ["Data","Memoir"],
        "url": "/data/weekly_memoir/",
        "teaser": null
      },{
        "title": "[회고록] 23년 3월 3주차 회고록",
        "excerpt":"  출장 업무를 마치고 KTX를 타고 서울로 올라가며 한 주를 마무리하고 있습니다. 출장길은 언제나 고되지만, 좋은 결과를 얻어갈 수 있다면 나름 다닐만?하다고 생각됩니다. 이번 회고록에서는 다음 2가지 얘기를 해보고자 합니다. 커뮤니케이션: 데이터 분석가와 클라이언트 간 회의에 대하여 데이터 리터러시 회고록이다 보니 위 2가지 에 대해 개념을 적는 글이 아니고 업무를...","categories": ["Data"],
        "tags": ["Data","Memoir"],
        "url": "/data/weekly_memoir_2/",
        "teaser": null
      }]
